ryankurte/efm32-base/device/EFR32MG22/Include/efr32mg22_rootcfg.h
/* Bit fields for ROOTCFG ROOTMODELOCK */
#define _ROOTCFG_ROOTMODELOCK_RESETVALUE                   0x00000000UL                                 /**< Default value for ROOTCFG_ROOTMODELOCK      */
#define _ROOTCFG_ROOTMODELOCK_MASK                         0x0000FFFFUL                                 /**< Mask for ROOTCFG_ROOTMODELOCK               */
#define _ROOTCFG_ROOTMODELOCK_LOCKKEY_SHIFT                0                                            /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_ROOTMODELOCK_LOCKKEY_MASK                 0xFFFFUL                                     /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_ROOTMODELOCK_LOCKKEY_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for ROOTCFG_ROOTMODELOCK       */
#define _ROOTCFG_ROOTMODELOCK_LOCKKEY_LOCK                 0x00000000UL                                 /**< Mode LOCK for ROOTCFG_ROOTMODELOCK           */
#define _ROOTCFG_ROOTMODELOCK_LOCKKEY_UNLOCK               0x00001E98UL                                 /**< Mode UNLOCK for ROOTCFG_ROOTMODELOCK         */
#define ROOTCFG_ROOTMODELOCK_LOCKKEY_DEFAULT               (_ROOTCFG_ROOTMODELOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_ROOTMODELOCK*/
#define ROOTCFG_ROOTMODELOCK_LOCKKEY_LOCK                  (_ROOTCFG_ROOTMODELOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_ROOTMODELOCK   */
#define ROOTCFG_ROOTMODELOCK_LOCKKEY_UNLOCK                (_ROOTCFG_ROOTMODELOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_ROOTMODELOCK */

/* Bit fields for ROOTCFG ROOTDBGLOCK */
#define _ROOTCFG_ROOTDBGLOCK_RESETVALUE                    0x00000000UL                                /**< Default value for ROOTCFG_ROOTDBGLOCK       */
#define _ROOTCFG_ROOTDBGLOCK_MASK                          0x0000FFFFUL                                /**< Mask for ROOTCFG_ROOTDBGLOCK                */
#define _ROOTCFG_ROOTDBGLOCK_LOCKKEY_SHIFT                 0                                           /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_ROOTDBGLOCK_LOCKKEY_MASK                  0xFFFFUL                                    /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_ROOTDBGLOCK_LOCKKEY_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for ROOTCFG_ROOTDBGLOCK        */
#define _ROOTCFG_ROOTDBGLOCK_LOCKKEY_LOCK                  0x00000000UL                                /**< Mode LOCK for ROOTCFG_ROOTDBGLOCK            */
#define _ROOTCFG_ROOTDBGLOCK_LOCKKEY_UNLOCK                0x00007267UL                                /**< Mode UNLOCK for ROOTCFG_ROOTDBGLOCK          */
#define ROOTCFG_ROOTDBGLOCK_LOCKKEY_DEFAULT                (_ROOTCFG_ROOTDBGLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_ROOTDBGLOCK*/
#define ROOTCFG_ROOTDBGLOCK_LOCKKEY_LOCK                   (_ROOTCFG_ROOTDBGLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_ROOTDBGLOCK    */
#define ROOTCFG_ROOTDBGLOCK_LOCKKEY_UNLOCK                 (_ROOTCFG_ROOTDBGLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_ROOTDBGLOCK  */

/* Bit fields for ROOTCFG USERDBGLOCK */
#define _ROOTCFG_USERDBGLOCK_RESETVALUE                    0x00000000UL                                /**< Default value for ROOTCFG_USERDBGLOCK       */
#define _ROOTCFG_USERDBGLOCK_MASK                          0x0000FFFFUL                                /**< Mask for ROOTCFG_USERDBGLOCK                */
#define _ROOTCFG_USERDBGLOCK_LOCKKEY_SHIFT                 0                                           /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_USERDBGLOCK_LOCKKEY_MASK                  0xFFFFUL                                    /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_USERDBGLOCK_LOCKKEY_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for ROOTCFG_USERDBGLOCK        */
#define _ROOTCFG_USERDBGLOCK_LOCKKEY_LOCK                  0x00000000UL                                /**< Mode LOCK for ROOTCFG_USERDBGLOCK            */
#define _ROOTCFG_USERDBGLOCK_LOCKKEY_UNLOCK                0x0000076FUL                                /**< Mode UNLOCK for ROOTCFG_USERDBGLOCK          */
#define ROOTCFG_USERDBGLOCK_LOCKKEY_DEFAULT                (_ROOTCFG_USERDBGLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_USERDBGLOCK*/
#define ROOTCFG_USERDBGLOCK_LOCKKEY_LOCK                   (_ROOTCFG_USERDBGLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_USERDBGLOCK    */
#define ROOTCFG_USERDBGLOCK_LOCKKEY_UNLOCK                 (_ROOTCFG_USERDBGLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_USERDBGLOCK  */

/* Bit fields for ROOTCFG USERNIDLOCK */
#define _ROOTCFG_USERNIDLOCK_RESETVALUE                    0x00000000UL                                /**< Default value for ROOTCFG_USERNIDLOCK       */
#define _ROOTCFG_USERNIDLOCK_MASK                          0x0000FFFFUL                                /**< Mask for ROOTCFG_USERNIDLOCK                */
#define _ROOTCFG_USERNIDLOCK_LOCKKEY_SHIFT                 0                                           /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_USERNIDLOCK_LOCKKEY_MASK                  0xFFFFUL                                    /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_USERNIDLOCK_LOCKKEY_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for ROOTCFG_USERNIDLOCK        */
#define _ROOTCFG_USERNIDLOCK_LOCKKEY_LOCK                  0x00000000UL                                /**< Mode LOCK for ROOTCFG_USERNIDLOCK            */
#define _ROOTCFG_USERNIDLOCK_LOCKKEY_UNLOCK                0x00004C3DUL                                /**< Mode UNLOCK for ROOTCFG_USERNIDLOCK          */
#define ROOTCFG_USERNIDLOCK_LOCKKEY_DEFAULT                (_ROOTCFG_USERNIDLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_USERNIDLOCK*/
#define ROOTCFG_USERNIDLOCK_LOCKKEY_LOCK                   (_ROOTCFG_USERNIDLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_USERNIDLOCK    */
#define ROOTCFG_USERNIDLOCK_LOCKKEY_UNLOCK                 (_ROOTCFG_USERNIDLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_USERNIDLOCK  */

