ryankurte/efm32-base/device/EFR32MG22/Include/efr32mg22_rootcfg.h
/* Bit fields for ROOTCFG MFRLOCKVAL1 */
#define _ROOTCFG_MFRLOCKVAL1_RESETVALUE                    0x29A0EC34UL                            /**< Default value for ROOTCFG_MFRLOCKVAL1       */
#define _ROOTCFG_MFRLOCKVAL1_MASK                          0xFFFFFFFFUL                            /**< Mask for ROOTCFG_MFRLOCKVAL1                */
#define _ROOTCFG_MFRLOCKVAL1_VAL_SHIFT                     0                                       /**< Shift value for ROOTCFG_VAL                 */
#define _ROOTCFG_MFRLOCKVAL1_VAL_MASK                      0xFFFFFFFFUL                            /**< Bit mask for ROOTCFG_VAL                    */
#define _ROOTCFG_MFRLOCKVAL1_VAL_DEFAULT                   0x29A0EC34UL                            /**< Mode DEFAULT for ROOTCFG_MFRLOCKVAL1        */
#define ROOTCFG_MFRLOCKVAL1_VAL_DEFAULT                    (_ROOTCFG_MFRLOCKVAL1_VAL_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_MFRLOCKVAL1*/

/* Bit fields for ROOTCFG LOCKSTATUS */
#define _ROOTCFG_LOCKSTATUS_RESETVALUE                     0x011F0107UL                                      /**< Default value for ROOTCFG_LOCKSTATUS        */
#define _ROOTCFG_LOCKSTATUS_MASK                           0x011F0117UL                                      /**< Mask for ROOTCFG_LOCKSTATUS                 */
#define ROOTCFG_LOCKSTATUS_BUSLOCK                         (0x1UL << 0)                                      /**< Bus Lock                                    */
#define _ROOTCFG_LOCKSTATUS_BUSLOCK_SHIFT                  0                                                 /**< Shift value for ROOTCFG_BUSLOCK             */
#define _ROOTCFG_LOCKSTATUS_BUSLOCK_MASK                   0x1UL                                             /**< Bit mask for ROOTCFG_BUSLOCK                */
#define _ROOTCFG_LOCKSTATUS_BUSLOCK_DEFAULT                0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_BUSLOCK_DEFAULT                 (_ROOTCFG_LOCKSTATUS_BUSLOCK_DEFAULT << 0)        /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_REGLOCK                         (0x1UL << 1)                                      /**< Register Lock                               */
#define _ROOTCFG_LOCKSTATUS_REGLOCK_SHIFT                  1                                                 /**< Shift value for ROOTCFG_REGLOCK             */
#define _ROOTCFG_LOCKSTATUS_REGLOCK_MASK                   0x2UL                                             /**< Bit mask for ROOTCFG_REGLOCK                */
#define _ROOTCFG_LOCKSTATUS_REGLOCK_DEFAULT                0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_REGLOCK_DEFAULT                 (_ROOTCFG_LOCKSTATUS_REGLOCK_DEFAULT << 1)        /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_MFRLOCK                         (0x1UL << 2)                                      /**< Manufacture Lock                            */
#define _ROOTCFG_LOCKSTATUS_MFRLOCK_SHIFT                  2                                                 /**< Shift value for ROOTCFG_MFRLOCK             */
#define _ROOTCFG_LOCKSTATUS_MFRLOCK_MASK                   0x4UL                                             /**< Bit mask for ROOTCFG_MFRLOCK                */
#define _ROOTCFG_LOCKSTATUS_MFRLOCK_DEFAULT                0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_MFRLOCK_DEFAULT                 (_ROOTCFG_LOCKSTATUS_MFRLOCK_DEFAULT << 2)        /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_ROOTMODELOCK                    (0x1UL << 4)                                      /**< Root Mode Lock                              */
#define _ROOTCFG_LOCKSTATUS_ROOTMODELOCK_SHIFT             4                                                 /**< Shift value for ROOTCFG_ROOTMODELOCK        */
#define _ROOTCFG_LOCKSTATUS_ROOTMODELOCK_MASK              0x10UL                                            /**< Bit mask for ROOTCFG_ROOTMODELOCK           */
#define _ROOTCFG_LOCKSTATUS_ROOTMODELOCK_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_ROOTMODELOCK_DEFAULT            (_ROOTCFG_LOCKSTATUS_ROOTMODELOCK_DEFAULT << 4)   /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_ROOTDBGLOCK                     (0x1UL << 8)                                      /**< Root Debug Lock                             */
#define _ROOTCFG_LOCKSTATUS_ROOTDBGLOCK_SHIFT              8                                                 /**< Shift value for ROOTCFG_ROOTDBGLOCK         */
#define _ROOTCFG_LOCKSTATUS_ROOTDBGLOCK_MASK               0x100UL                                           /**< Bit mask for ROOTCFG_ROOTDBGLOCK            */
#define _ROOTCFG_LOCKSTATUS_ROOTDBGLOCK_DEFAULT            0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_ROOTDBGLOCK_DEFAULT             (_ROOTCFG_LOCKSTATUS_ROOTDBGLOCK_DEFAULT << 8)    /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_USERDBGLOCK                     (0x1UL << 16)                                     /**< User Invasive Debug Lock                    */
#define _ROOTCFG_LOCKSTATUS_USERDBGLOCK_SHIFT              16                                                /**< Shift value for ROOTCFG_USERDBGLOCK         */
#define _ROOTCFG_LOCKSTATUS_USERDBGLOCK_MASK               0x10000UL                                         /**< Bit mask for ROOTCFG_USERDBGLOCK            */
#define _ROOTCFG_LOCKSTATUS_USERDBGLOCK_DEFAULT            0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_USERDBGLOCK_DEFAULT             (_ROOTCFG_LOCKSTATUS_USERDBGLOCK_DEFAULT << 16)   /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_USERNIDLOCK                     (0x1UL << 17)                                     /**< User Non-invasive Debug Lock                */
#define _ROOTCFG_LOCKSTATUS_USERNIDLOCK_SHIFT              17                                                /**< Shift value for ROOTCFG_USERNIDLOCK         */
#define _ROOTCFG_LOCKSTATUS_USERNIDLOCK_MASK               0x20000UL                                         /**< Bit mask for ROOTCFG_USERNIDLOCK            */
#define _ROOTCFG_LOCKSTATUS_USERNIDLOCK_DEFAULT            0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_USERNIDLOCK_DEFAULT             (_ROOTCFG_LOCKSTATUS_USERNIDLOCK_DEFAULT << 17)   /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_USERSPIDLOCK                    (0x1UL << 18)                                     /**< User Secure Invasive Debug Lock             */
#define _ROOTCFG_LOCKSTATUS_USERSPIDLOCK_SHIFT             18                                                /**< Shift value for ROOTCFG_USERSPIDLOCK        */
#define _ROOTCFG_LOCKSTATUS_USERSPIDLOCK_MASK              0x40000UL                                         /**< Bit mask for ROOTCFG_USERSPIDLOCK           */
#define _ROOTCFG_LOCKSTATUS_USERSPIDLOCK_DEFAULT           0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_USERSPIDLOCK_DEFAULT            (_ROOTCFG_LOCKSTATUS_USERSPIDLOCK_DEFAULT << 18)  /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_USERSPNIDLOCK                   (0x1UL << 19)                                     /**< User Secure Non-invasive Debug Lock         */
#define _ROOTCFG_LOCKSTATUS_USERSPNIDLOCK_SHIFT            19                                                /**< Shift value for ROOTCFG_USERSPNIDLOCK       */
#define _ROOTCFG_LOCKSTATUS_USERSPNIDLOCK_MASK             0x80000UL                                         /**< Bit mask for ROOTCFG_USERSPNIDLOCK          */
#define _ROOTCFG_LOCKSTATUS_USERSPNIDLOCK_DEFAULT          0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_USERSPNIDLOCK_DEFAULT           (_ROOTCFG_LOCKSTATUS_USERSPNIDLOCK_DEFAULT << 19) /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_USERDBGAPLOCK                   (0x1UL << 20)                                     /**< User Debug Access Port Lock                 */
#define _ROOTCFG_LOCKSTATUS_USERDBGAPLOCK_SHIFT            20                                                /**< Shift value for ROOTCFG_USERDBGAPLOCK       */
#define _ROOTCFG_LOCKSTATUS_USERDBGAPLOCK_MASK             0x100000UL                                        /**< Bit mask for ROOTCFG_USERDBGAPLOCK          */
#define _ROOTCFG_LOCKSTATUS_USERDBGAPLOCK_DEFAULT          0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_USERDBGAPLOCK_DEFAULT           (_ROOTCFG_LOCKSTATUS_USERDBGAPLOCK_DEFAULT << 20) /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */
#define ROOTCFG_LOCKSTATUS_RADIODBGLOCK                    (0x1UL << 24)                                     /**< Radio Debug Lock                            */
#define _ROOTCFG_LOCKSTATUS_RADIODBGLOCK_SHIFT             24                                                /**< Shift value for ROOTCFG_RADIODBGLOCK        */
#define _ROOTCFG_LOCKSTATUS_RADIODBGLOCK_MASK              0x1000000UL                                       /**< Bit mask for ROOTCFG_RADIODBGLOCK           */
#define _ROOTCFG_LOCKSTATUS_RADIODBGLOCK_DEFAULT           0x00000001UL                                      /**< Mode DEFAULT for ROOTCFG_LOCKSTATUS         */
#define ROOTCFG_LOCKSTATUS_RADIODBGLOCK_DEFAULT            (_ROOTCFG_LOCKSTATUS_RADIODBGLOCK_DEFAULT << 24)  /**< Shifted mode DEFAULT for ROOTCFG_LOCKSTATUS */

/* Bit fields for ROOTCFG UNLOCKSTATUS */
#define _ROOTCFG_UNLOCKSTATUS_RESETVALUE                   0x00000010UL                                          /**< Default value for ROOTCFG_UNLOCKSTATUS      */
#define _ROOTCFG_UNLOCKSTATUS_MASK                         0x011F0117UL                                          /**< Mask for ROOTCFG_UNLOCKSTATUS               */
#define ROOTCFG_UNLOCKSTATUS_BUSUNLOCK                     (0x1UL << 0)                                          /**< Bus Unlock                                  */
#define _ROOTCFG_UNLOCKSTATUS_BUSUNLOCK_SHIFT              0                                                     /**< Shift value for ROOTCFG_BUSUNLOCK           */
#define _ROOTCFG_UNLOCKSTATUS_BUSUNLOCK_MASK               0x1UL                                                 /**< Bit mask for ROOTCFG_BUSUNLOCK              */
#define _ROOTCFG_UNLOCKSTATUS_BUSUNLOCK_DEFAULT            0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_BUSUNLOCK_DEFAULT             (_ROOTCFG_UNLOCKSTATUS_BUSUNLOCK_DEFAULT << 0)        /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_REGUNLOCK                     (0x1UL << 1)                                          /**< Register Unlock                             */
#define _ROOTCFG_UNLOCKSTATUS_REGUNLOCK_SHIFT              1                                                     /**< Shift value for ROOTCFG_REGUNLOCK           */
#define _ROOTCFG_UNLOCKSTATUS_REGUNLOCK_MASK               0x2UL                                                 /**< Bit mask for ROOTCFG_REGUNLOCK              */
#define _ROOTCFG_UNLOCKSTATUS_REGUNLOCK_DEFAULT            0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_REGUNLOCK_DEFAULT             (_ROOTCFG_UNLOCKSTATUS_REGUNLOCK_DEFAULT << 1)        /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_MFRUNLOCK                     (0x1UL << 2)                                          /**< Manufacture Unlock                          */
#define _ROOTCFG_UNLOCKSTATUS_MFRUNLOCK_SHIFT              2                                                     /**< Shift value for ROOTCFG_MFRUNLOCK           */
#define _ROOTCFG_UNLOCKSTATUS_MFRUNLOCK_MASK               0x4UL                                                 /**< Bit mask for ROOTCFG_MFRUNLOCK              */
#define _ROOTCFG_UNLOCKSTATUS_MFRUNLOCK_DEFAULT            0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_MFRUNLOCK_DEFAULT             (_ROOTCFG_UNLOCKSTATUS_MFRUNLOCK_DEFAULT << 2)        /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_ROOTMODEUNLOCK                (0x1UL << 4)                                          /**< Root Mode Unlock                            */
#define _ROOTCFG_UNLOCKSTATUS_ROOTMODEUNLOCK_SHIFT         4                                                     /**< Shift value for ROOTCFG_ROOTMODEUNLOCK      */
#define _ROOTCFG_UNLOCKSTATUS_ROOTMODEUNLOCK_MASK          0x10UL                                                /**< Bit mask for ROOTCFG_ROOTMODEUNLOCK         */
#define _ROOTCFG_UNLOCKSTATUS_ROOTMODEUNLOCK_DEFAULT       0x00000001UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_ROOTMODEUNLOCK_DEFAULT        (_ROOTCFG_UNLOCKSTATUS_ROOTMODEUNLOCK_DEFAULT << 4)   /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_ROOTDBGUNLOCK                 (0x1UL << 8)                                          /**< Root Debug Unlock                           */
#define _ROOTCFG_UNLOCKSTATUS_ROOTDBGUNLOCK_SHIFT          8                                                     /**< Shift value for ROOTCFG_ROOTDBGUNLOCK       */
#define _ROOTCFG_UNLOCKSTATUS_ROOTDBGUNLOCK_MASK           0x100UL                                               /**< Bit mask for ROOTCFG_ROOTDBGUNLOCK          */
#define _ROOTCFG_UNLOCKSTATUS_ROOTDBGUNLOCK_DEFAULT        0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_ROOTDBGUNLOCK_DEFAULT         (_ROOTCFG_UNLOCKSTATUS_ROOTDBGUNLOCK_DEFAULT << 8)    /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_USERDBGUNLOCK                 (0x1UL << 16)                                         /**< User Invasive Debug Unlock                  */
#define _ROOTCFG_UNLOCKSTATUS_USERDBGUNLOCK_SHIFT          16                                                    /**< Shift value for ROOTCFG_USERDBGUNLOCK       */
#define _ROOTCFG_UNLOCKSTATUS_USERDBGUNLOCK_MASK           0x10000UL                                             /**< Bit mask for ROOTCFG_USERDBGUNLOCK          */
#define _ROOTCFG_UNLOCKSTATUS_USERDBGUNLOCK_DEFAULT        0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_USERDBGUNLOCK_DEFAULT         (_ROOTCFG_UNLOCKSTATUS_USERDBGUNLOCK_DEFAULT << 16)   /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_USERNIDUNLOCK                 (0x1UL << 17)                                         /**< User Non-invasive Debug Unlock              */
#define _ROOTCFG_UNLOCKSTATUS_USERNIDUNLOCK_SHIFT          17                                                    /**< Shift value for ROOTCFG_USERNIDUNLOCK       */
#define _ROOTCFG_UNLOCKSTATUS_USERNIDUNLOCK_MASK           0x20000UL                                             /**< Bit mask for ROOTCFG_USERNIDUNLOCK          */
#define _ROOTCFG_UNLOCKSTATUS_USERNIDUNLOCK_DEFAULT        0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_USERNIDUNLOCK_DEFAULT         (_ROOTCFG_UNLOCKSTATUS_USERNIDUNLOCK_DEFAULT << 17)   /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_USERSPIDUNLOCK                (0x1UL << 18)                                         /**< User Secure Invasive Debug Unlock           */
#define _ROOTCFG_UNLOCKSTATUS_USERSPIDUNLOCK_SHIFT         18                                                    /**< Shift value for ROOTCFG_USERSPIDUNLOCK      */
#define _ROOTCFG_UNLOCKSTATUS_USERSPIDUNLOCK_MASK          0x40000UL                                             /**< Bit mask for ROOTCFG_USERSPIDUNLOCK         */
#define _ROOTCFG_UNLOCKSTATUS_USERSPIDUNLOCK_DEFAULT       0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_USERSPIDUNLOCK_DEFAULT        (_ROOTCFG_UNLOCKSTATUS_USERSPIDUNLOCK_DEFAULT << 18)  /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_USERSPNIDUNLOCK               (0x1UL << 19)                                         /**< User Secure Non-invasive Debug Unlock       */
#define _ROOTCFG_UNLOCKSTATUS_USERSPNIDUNLOCK_SHIFT        19                                                    /**< Shift value for ROOTCFG_USERSPNIDUNLOCK     */
#define _ROOTCFG_UNLOCKSTATUS_USERSPNIDUNLOCK_MASK         0x80000UL                                             /**< Bit mask for ROOTCFG_USERSPNIDUNLOCK        */
#define _ROOTCFG_UNLOCKSTATUS_USERSPNIDUNLOCK_DEFAULT      0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_USERSPNIDUNLOCK_DEFAULT       (_ROOTCFG_UNLOCKSTATUS_USERSPNIDUNLOCK_DEFAULT << 19) /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_USERDBGAPUNLOCK               (0x1UL << 20)                                         /**< User Secure Debug Access Port Unlock        */
#define _ROOTCFG_UNLOCKSTATUS_USERDBGAPUNLOCK_SHIFT        20                                                    /**< Shift value for ROOTCFG_USERDBGAPUNLOCK     */
#define _ROOTCFG_UNLOCKSTATUS_USERDBGAPUNLOCK_MASK         0x100000UL                                            /**< Bit mask for ROOTCFG_USERDBGAPUNLOCK        */
#define _ROOTCFG_UNLOCKSTATUS_USERDBGAPUNLOCK_DEFAULT      0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_USERDBGAPUNLOCK_DEFAULT       (_ROOTCFG_UNLOCKSTATUS_USERDBGAPUNLOCK_DEFAULT << 20) /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/
#define ROOTCFG_UNLOCKSTATUS_RADIODBGUNLOCK                (0x1UL << 24)                                         /**< Radio Debug Unlock                          */
#define _ROOTCFG_UNLOCKSTATUS_RADIODBGUNLOCK_SHIFT         24                                                    /**< Shift value for ROOTCFG_RADIODBGUNLOCK      */
#define _ROOTCFG_UNLOCKSTATUS_RADIODBGUNLOCK_MASK          0x1000000UL                                           /**< Bit mask for ROOTCFG_RADIODBGUNLOCK         */
#define _ROOTCFG_UNLOCKSTATUS_RADIODBGUNLOCK_DEFAULT       0x00000000UL                                          /**< Mode DEFAULT for ROOTCFG_UNLOCKSTATUS       */
#define ROOTCFG_UNLOCKSTATUS_RADIODBGUNLOCK_DEFAULT        (_ROOTCFG_UNLOCKSTATUS_RADIODBGUNLOCK_DEFAULT << 24)  /**< Shifted mode DEFAULT for ROOTCFG_UNLOCKSTATUS*/

/* Bit fields for ROOTCFG CTRL */
#define _ROOTCFG_CTRL_RESETVALUE                           0x00000000UL                                           /**< Default value for ROOTCFG_CTRL              */
#define _ROOTCFG_CTRL_MASK                                 0x00000058UL                                           /**< Mask for ROOTCFG_CTRL                       */
#define _ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_SHIFT          3                                                      /**< Shift value for ROOTCFG_EFUSEPOWERRAMPGPIOSEL*/
#define _ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_MASK           0x18UL                                                 /**< Bit mask for ROOTCFG_EFUSEPOWERRAMPGPIOSEL  */
#define _ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_DEFAULT        0x00000000UL                                           /**< Mode DEFAULT for ROOTCFG_CTRL               */
#define _ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIO_9_PC0     0x00000000UL                                           /**< Mode GPIO_9_PC0 for ROOTCFG_CTRL             */
#define _ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIP_11_PC2    0x00000001UL                                           /**< Mode GPIP_11_PC2 for ROOTCFG_CTRL            */
#define _ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIO_13_PC4    0x00000002UL                                           /**< Mode GPIO_13_PC4 for ROOTCFG_CTRL            */
#define ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_DEFAULT         (_ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_DEFAULT << 3)     /**< Shifted mode DEFAULT for ROOTCFG_CTRL       */
#define ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIO_9_PC0      (_ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIO_9_PC0 << 3)  /**< Shifted mode GPIO_9_PC0 for ROOTCFG_CTRL     */
#define ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIP_11_PC2     (_ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIP_11_PC2 << 3) /**< Shifted mode GPIP_11_PC2 for ROOTCFG_CTRL    */
#define ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIO_13_PC4     (_ROOTCFG_CTRL_EFUSEPOWERRAMPGPIOSEL_GPIO_13_PC4 << 3) /**< Shifted mode GPIO_13_PC4 for ROOTCFG_CTRL    */
#define ROOTCFG_CTRL_EFUSEDIS                              (0x1UL << 6)                                           /**< gate off efuse clock                        */
#define _ROOTCFG_CTRL_EFUSEDIS_SHIFT                       6                                                      /**< Shift value for ROOTCFG_EFUSEDIS            */
#define _ROOTCFG_CTRL_EFUSEDIS_MASK                        0x40UL                                                 /**< Bit mask for ROOTCFG_EFUSEDIS               */
#define _ROOTCFG_CTRL_EFUSEDIS_DEFAULT                     0x00000000UL                                           /**< Mode DEFAULT for ROOTCFG_CTRL               */
#define ROOTCFG_CTRL_EFUSEDIS_DEFAULT                      (_ROOTCFG_CTRL_EFUSEDIS_DEFAULT << 6)                  /**< Shifted mode DEFAULT for ROOTCFG_CTRL       */

